#include <iostream>
#define _USE_MATH_DEFINES
#include<math.h>
using namespace std;
int main() { 
	setlocale(LC_ALL, "Russian");
	long double s1, s2, s3, s4, s5, s6, s7, s8, s9, s10, p1, p2, p3, p4, p5, p6, p7, p8, p9, p10;
	cout << "Задайте количество слагаемых/множителей N" << endl;
	long double N;
	cin >> N;
	if ((N > 0) && (N - int(N) == 0)) {

		int i1; s1 = 0;
		for (i1 = 1; i1 <= N; i1++)
			s1 += i1;
		cout << "а) Сумма первых N натуральных чисел= " << s1 << endl;

		int i11; p1 = 1;
		for (i11 = 1; i11 <= N; i11++)
			p1 *= i11;
		cout << "   Произведение первых N натуральных чисел = " << p1 << endl;

		int i2, y; s2 = 0;
		for (i2 = 1; i2 <= N; i2++)
		{
			y = 2 * i2;
			s2 += y;
		} cout << "б) Сумма первых N четных чисел = " << s2 << endl;

		int i21, y1; p2 = 1;
		for (i21 = 1; i21 <= N; i21++)
		{
			y1 = i21 * 2;
			p2 *= y1;
		} cout << "    Произведение первых N четных чисел = " << p2 << endl;

		int i3, k; s3 = 0;
		for (i3 = 1; i3 <= N; i3++)
		{
			k = 2 * i3 - 1;
			s3 += k;
		} cout << "в) Сумма первых N нечетных чисел = " << s3 << endl;

		int i31, k1; p3 = 1;
		for (i31 = 1; i31 <= N; i31++)
		{
			k1 = 2 * i31 - 1;
			p3 *= k1;
		}
		cout << "  Произведение первых N нечетных чисел = " << p3 << endl;

		int i4, l; s4 = 0;
		for (i4 = 1; i4 <= N; i4++)
		{
			l = pow(2, i4);
			s4 += l;
		} cout << "г) Сумма первых N степеней двойки = " << s4 << endl;

		int i41, l1; p4 = 1;
		for (i41 = 1; i41 <= N; i41++)
		{
			l1 = pow(2, i41);
			p4 *= l1;
		}
		cout << "  Произведение первых N степеней двойки = " << p4 << endl;


		int i5; s5 = 0;
		for (i5 = 1; i5 <= N; i5++)
			s5 += (1.0 / i5);
		cout << "д) Сумма первых N дробей вида 1/1  1/2  1/3  1/4 1/5= " << s5 << endl;

		int i51; p5 = 1;
		for (i51 = 1; i51 <= N; i51++)
			p5 *= 1.0 / i51;
		cout << "   Произведение первых дробей вида N 1/1  1/2  1/3  1/4 1/5= " << p5 << endl;


		int i6, m; s6 = 0;
		for (i6 = 1; i6 <= N; i6++) {
			m = 2 * i6;
			s6 += (1.0 / m);
		}
		cout << "е) Сумма первых N дробей вида 1/2  1/4  1/6  1/8 = " << s6 << endl;

		int m1, i61;
		p6 = 1;
		for (i61 = 1; i61 <= N; i61++) {
			m1 = 2 * i61;
			p6 *= (1.0 / m1);
		}
		cout << "   Произведение первых N дробей вида  1/2  1/4  1/6  1/8= " << p6 << endl;


		int i7, J; s7 = 0;
		for (i7 = 1; i7 <= N; i7++)
		{
			J = 2 * i7 - 1;
			s7 += 1.0 / J;
		} cout << "ж) Сумма первых N дробей вида 1/1  1/3  1/5  1/7 = " << s7 << endl;

		int i71, J1; p7 = 1;
		for (i71 = 1; i71 <= N; i71++)
		{
			J1 = 2 * i71 - 1;
			p7 *= 1.0 / J1;
		}
		cout << "  Произведение первых N дробей вида 1/1  1/3  1/5  1/7 = " << p7 << endl;


		int i8, f; s8 = 0;
		for (i8 = 1; i8 <= N; i8++)
		{
			f = pow(2, i8);
			s8 += 1.0 / f;
		} cout << "з) Сумма первых N дробей вида 1/2  1/4  1/8  1/16 = " << s8 << endl;

		int i81, f1; p8 = 1;
		for (i81 = 1; i81 <= N; i81++)
		{
			f1 = pow(2, i81);
			p8 *= 1.0 / f1;
		}
		cout << "  Произведение первых N дробей вида 1/2  1/4  1/8  1/16 = " << p8 << endl;

		int v = 0;
		long double s9 = 0, p9 = 1, d = 0;
		for (int i9 = 1; v < N; i9++) {
			d = pow(i9, -1);
			if (i9 % 2 == 0) d *= -1;
			v = v + 1;
			s9 = d + s9;
			p9 = p9 * d;
		}
		cout << "и) Сумма первых N дробей вида 1/1  -1/2  1/3  -1/4 = " << s9 << endl;
		cout << "  Произведение первых N дробей вида 1/1  -1/2  1/3  -1/4 = " << p9 << endl;
		
				long double s10 = 0, p10 = 1;
				long double h = 1;
				for (long int i10 = 1; i10 <= N; i10++) {
					h = h * i10;
					s10 = s10 + 1/h;
					p10 = p10 * 1/h;
				}
			cout << "к) Сумма первых N дробей вида 1/1  1/2  1/6  1/24 = " << s10 << endl;
			cout << "  Произведение первых N дробей вида 1/1  1/2  1/6  1/24 = " << p10 << endl;
		} else
 cout << "Вы ввели не натуральное число" << endl;
	system("pause");
	return 0;
}

