// 1. Прямоугольное поле m × n разбито на mn квадратных клеток. Некоторые клетки покрашены в чёрный цвет. 
// Известно, что все чёрные клетки могут быть разбиты на несколько непересекающихся и не имеющих общих вершин
// чёрных прямоугольников. Считая, что цвета клеток даны в виде массива типа подсчитать число чёрных 
// прямоугольников. (Формально, дано поле морского боя, посчитать количество кораблей на нем).
function task_1(){

}
// 2. Дан массив целых чисел. Найти наибольшую сумму подряд идущих элементов. 
// (Например, [1, 0, -4, 5, 6, -7,-2, 3, 8] -> максимальная сумма: 13. */
function task_2(){

}
// 3. Дано 3 массива. Найти элементы, которые встречаются в каких-либо 2 массивах, но их нету в 3 массиве.
function task_3(){

} 
// 4. Дано предложение на русском языке. Определить, является ли оно панграммой.
function task_4(){

}
// 5. Дана дата и число K. Определить день недели, который будет через K дней от данной даты. */

function task_5(){

}

